/*数据库(DATABASE,DB)
    按照数据结构组织,管理和存储数据的仓库
  数据库管理系统(DBMS)
    用于对数据库的操作和管理,是一种软件
        MySQL
            关系型数据库管理系统
* */

/*MySQL Shell
*   交互式JS, Python 和 SQL终端
*在命令行中输入
*   mysqlsh
*   启动
* */

/*MySQL指令:以反斜杠开头
*   \help    显示帮助
*   \connect 连接到MySQL数据库
*       \connect root@localhost     连接到本地MySQL数据库
*       \use     指定一个数据库
*           \语言简写   切换到对应语言
*               \js   切换到JS
*               \py   切换到Python
*               \sql  切换到SQL
* */

/*关系型数据管理系统(RDBMS)和非关系型数据管理系统(NON-DBMS)
*   关系型数据管理系统(RDBMS)
*       采用关系模型组织数据,通过二维表来表示数据之间的联系
*           二维表的每一行表示一条数据记录,每一列表示一个字段,也就是记录的某个属性.不同表之间通过关联字段来建立联系.
*   非关系型数据管理系统(NON-DBMS)
*       对关系型数据管理系统的补充和扩展
*
* */
