package YuanXi;

import java.util.Random;

/**
 * 好玩用的
 *
 * @author YuanXi
 * @version 2024.2.28
 */

public class Fun {
    /**
     * 随机提供启动程序的吉祥物
     * @return 吉祥物
     *
     * {@code
     * 示例用法:
     * // main方法开始时或恰当时机
     * Fun justForFun = new Fun();
     * String pet = justForFun.getPet(null,null);
     * System.out.println(pet);
     * }
     */
    public String getPet(String info, String bugInfo) {
        // 默认名称
        if (info == null) {
            info = ("本次程序执行工");
        }

        if (bugInfo == null) {
            bugInfo = ("木坎桯厅纨彳亍エ");
        }
        Random random = new Random();
        int porterId = random.nextInt(4);
        return switch (porterId) {
            case 0 -> """
                     /\\_/\\
                    ( o.o )
                     >口  <
                    ↑""" + info + "(喜欢把程序搞砸)";
            case 1 -> """
                    　　　　∧＿∧
                    　　;;（´・ω・）
                    　＿旦_(っ(,,■)＿＿
                    |l￣l||￣しﾞ しﾞ￣|i
                    ↑""" + info + "(喜欢拖慢程序进程)";
            case 2 -> """
                                                          .@.        @*...-..
                                                           .=:....-%+.     .@%-#.
                                                                   .-.-...=*   .@@
                                     ...........-::.=.:...:.               .@@@#%@.
                             ..:-+@@@@@@@@@@@@@@@@@@@@@@@@@@@@@+..           %#@#@=
                      =.=+@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=..@+%@##@   @*
                    %@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@%%@@@@@@###=#@%:.=
                     .   #.+:..=+@@@@@@@@@@@@@@@@@@@@@@@@@@@+.-   .:..#-++
                                 @@  :@* ..----==+@@@@@@@@%
                             *.@*@@.  %@#          .@@#  =@
                          %%@#=+.     .@@           -@.  .@=
                         .@.       .=@@-.           .@@   @@
                         .-     .#@@..               -@.  #@%
                     ↑""" + bugInfo + "(ϲ�����³���拷锟斤拷锟�)";
            case 3 -> """
                                 # # # # # # # # # # # # #
                            #                           #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
                       ##   #       ##                  #
                       #  # #     #  #                  #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
                       #   # # # #   #                  #       # #
                      #               #                 # # # #    #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
                    #     #      #      #               #        #
                    #                   #               # # # # #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
                      #    |__|__|    #                 #
                        # # # # # # # # # # # # # # # #  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
                         # #     # #       # #     # #
                       ↑""" + "#######" + "(####~~~~)";
            default -> null;
        };
    }

    /**
     * getPet()方法的无参简写
     *
     * @return 吉祥物
     */
    public String getPet() {
        return getPet(null, null);
    }
}
