//基本语法
//和Java,C差不多
/*两种注释方法*/
/*
    1.严格区分大小写
    2.空白字符自动忽略
    3.严格格式化时,每条语句末位需要分号
*/

//变量
    //声明:JS变量是动态类型变量,而不是Java的强类型
        let x = 1;
        console.log(x);
        x = "x";
        console.log(x);
        var y = 1;
        //var是全局变量，let是局部变量.var是旧版的声明方式,对于块作用域有不足;现代的声明变量尽量使用let.
    //内存结构
        /*
            变量的存储:由于类型不确定,所有变量都会像 Java 的 String 一样存储地址而不是值本身.
        */

//常量
    //声明
    const PI = 3.1415926535897932384626;

//标识符
    /* 命名规范(和Java一样)
        1. 标识符只能含有字母,数字,_.$组成,不能数字开头
        2. 不能是保留字
        3. 变量名使用驼峰命名法;类名使用大驼峰命名法;常量全部大写
    */

//数据类型
    /* 原始值
        1. 数值 (Number)
            所有整数和浮点数
            超过一定范围后会显示近似值或 Infinity (无穷大,其实是表现不出来了 -_-)
            小数运算可能不准确
        2. 大整数 (BigInt)
            用来表示比较大的整数,数字以n结尾,如 let a = 999999999999999999999999999999999999999999999n, 如果不加
                n的话会变成科学计数法
            不能与Number混用运算
        3. 字符串 (String)
        4. 布尔值 (Boolean)
        5. 空值 (Null)
        6. 未定义 (Undefined)
        7. 符号 (Symbol)
    */

    /* 类型检查
        typeof 方法检查变量的值的类型,而不是变量类型;
        **Js不存在变量类型(变量仅用作存储地址),只存在数据类型**
    */
    let a = 1, b = 2n;
    console.log(typeof a, typeof b);